In [ ]:
"""Find out the range of the location (start, end) of the score median for each job, order by job ascending"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists grade;

CREATE TABLE  grade(
`id` int(4) NOT NULL,
`job` varchar(32) NOT NULL,
`score` int(10) NOT NULL,
PRIMARY KEY (`id`));

INSERT INTO grade VALUES
(1,'C++',11001),
(2,'C++',10000),
(3,'C++',9000),
(4,'Java',12000),
(5,'Java',13000),
(6,'B',12000),
(7,'B',11000),
(8,'B',9999);

In [ ]:
"""SQL solution"""
SELECT a.job, (num+1) DIV 2, (num+2) DIV 2
FROM
(SELECT job, COUNT(*) AS num
FROM grade
GROUP BY job) AS a
ORDER BY a.job

In [6]:
"""pandas dataframe creation"""
import pandas as pd

grade = pd.DataFrame([(1,'C++',11001),
                      (2,'C++',10000),
                      (3,'C++',9000),
                      (4,'Java',12000),
                      (5,'Java',13000),
                      (6,'B',12000),
                      (7,'B',11000),
                      (8,'B',9999)],
                     columns=['id','job','score'])
grade.head()

   id   job  score
0   1   C++  11001
1   2   C++  10000
2   3   C++   9000
3   4  Java  12000
4   5  Java  13000

In [13]:
df = grade.groupby('job').size().reset_index()
df = df.rename(columns={0:'total'})
df

    job  total
0     B      3
1   C++      3
2  Java      2

In [15]:
df['start'] = (df['total'] + 1)//2
df['end'] = (df['total'] + 2)//2
df[['job', 'start', 'end']].sort_values(by='job')

    job  start  end
0     B      2    2
1   C++      2    2
2  Java      1    2